In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("tips.csv")
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
print(df.info())

<class 'pandas.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    str
 3   smoker      244 non-null    str
 4   day         244 non-null    str
 5   time        244 non-null    str
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), str(4)
memory usage: 13.5 KB
None

In [4]:
print(df.isnull().sum())

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [5]:
df.duplicated().sum()

np.int64(1)

In [6]:
df = df.drop_duplicates()

In [7]:
df.duplicated().sum()

np.int64(0)

In [8]:
df.describe()

       total_bill         tip        size
count  243.000000  243.000000  243.000000
mean    19.813868    3.002387    2.572016
std      8.910071    1.385002    0.952356
min      3.070000    1.000000    1.000000
25%     13.380000    2.000000    2.000000
50%     17.810000    2.920000    2.000000
75%     24.175000    3.575000    3.000000
max     50.810000   10.000000    6.000000

In [9]:
df['day'].unique()

<StringArray>
['Sun', 'Sat', 'Thur', 'Fri']
Length: 4, dtype: str

In [10]:
df['time'].unique()

<StringArray>
['Dinner', 'Lunch']
Length: 2, dtype: str

In [11]:
df['size'].unique()

array([2, 3, 4, 1, 6, 5])

In [12]:
df['tip_percentage'] = df.apply(lambda row: (row['tip'] / row['total_bill']) * 100, axis=1)

In [13]:
df.head()

   total_bill   tip     sex smoker  day    time  size  tip_percentage
0       16.99  1.01  Female     No  Sun  Dinner     2        5.944673
1       10.34  1.66    Male     No  Sun  Dinner     3       16.054159
2       21.01  3.50    Male     No  Sun  Dinner     3       16.658734
3       23.68  3.31    Male     No  Sun  Dinner     2       13.978041
4       24.59  3.61  Female     No  Sun  Dinner     4       14.680765

In [14]:
df['tip_percentage'].describe()

count    243.000000
mean      16.083121
std        6.119662
min        3.563814
25%       12.883281
50%       15.521855
75%       19.174638
max       71.034483
Name: tip_percentage, dtype: float64

In [15]:
df.describe()

       total_bill         tip        size  tip_percentage
count  243.000000  243.000000  243.000000      243.000000
mean    19.813868    3.002387    2.572016       16.083121
std      8.910071    1.385002    0.952356        6.119662
min      3.070000    1.000000    1.000000        3.563814
25%     13.380000    2.000000    2.000000       12.883281
50%     17.810000    2.920000    2.000000       15.521855
75%     24.175000    3.575000    3.000000       19.174638
max     50.810000   10.000000    6.000000       71.034483

In [16]:
df['size'].value_counts()

size
2    155
3     38
4     37
5      5
1      4
6      4
Name: count, dtype: int64

In [17]:
df['day'].value_counts()

day
Sat     87
Sun     76
Thur    61
Fri     19
Name: count, dtype: int64

In [18]:
df['sex'].value_counts()

sex
Male      157
Female     86
Name: count, dtype: int64

In [19]:
df['smoker'].value_counts()

smoker
No     151
Yes     92
Name: count, dtype: int64

In [20]:
df['time'].value_counts()

time
Dinner    176
Lunch      67
Name: count, dtype: int64

In [21]:
df['total_bill'].sum()

np.float64(4814.77)

In [22]:
df['tip_percentage'].mean()

np.float64(16.083120899771604)

In [23]:
df[['total_bill', 'tip', 'size', 'tip_percentage']].corr()

                total_bill       tip      size  tip_percentage
total_bill        1.000000  0.674998  0.597589       -0.339400
tip               0.674998  1.000000  0.488400        0.342408
size              0.597589  0.488400  1.000000       -0.143252
tip_percentage   -0.339400  0.342408 -0.143252        1.000000

In [24]:
df.to_csv("tips_modified.csv", index=False)